app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "bio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "Thomas"], ["email", "tnqkjlgeq@yahoo.com"], ["bio", "pupupupute"], ["created_at", "2018-10-30 13:49:39.035909"], ["updated_at", "2018-10-30 13:49:39.035909"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Pute"], ["updated_at", "2018-10-30 18:33:49.189686"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)